training_application/app/controllers/v1/leaves_controller.rb

    def index
        @leaves = Leave.all
---
SELECT "leaves".* FROM "leaves"